package com.zlc.paopaotang;



/**
 * Modle_map的子类，是雪地地图的modle。<br>
 * 这个函数负责做三个工作：<br>
 *（1）将一个静态的2维数组赋值给map。里面包含了关于这个地图不可变的一些信息。比如地图的背景图片。和障碍物的设置<br>
 *（2）根据地图的静态信息，随机产生一定数量的箱子。<br>
 *（3）根据地图的静态信息，随机产生一定数量的食物。<br>
 * @author 廖翊康
 * @version 4.0
 */

public class Modle_Snowfield extends Modle_map {

	/**
	 * 构造方法。构造方法里要做的就是初始化地图的静态信息和分配食物<br>
	 */
	Modle_Snowfield(int mapNum) {
		super(mapNum);
		initiate();
		initiate_food();
	}

	/**
	 * 这个函数负责做两个工作。<br>
	 *（1）将一个静态的2维数组赋值给map。里面包含了关于这个地图不可变的一些信息。比如地图的背景图片。和障碍物的设置<br>
	 *（2）根据地图的静态信息，随机产生一定数量的箱子。<br>
	 */
	protected void initiate() {
		map = new int[][] { { 0, 0, 7, 0, 7, 0, 7, 0, 7, 0, 7, 0, 7, 0, 0 },
				{ 7, 0, 7, 0, 7, 0, 7, 0, 7, 0, 7, 0, 7, 0, 7 },
				{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
				{ 7, 0, 7, 0, 2, 0, 7, 0, 3, 0, 2, 0, 7, 0, 7 },
				{ 0, 0, 0, 0, 0, 6, 5, 5, 5, 0, 0, 0, 0, 0, 0 },
				{ 7, 0, 2, 0, 0, 5, 5, 5, 5, 0, 0, 0, 4, 0, 7 },
				{ 0, 0, 0, 0, 2, 5, 5, 5, 5, 0, 2, 0, 0, 0, 0 },
				{ 7, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 7 },
				{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
				{ 7, 0, 7, 0, 4, 0, 7, 0, 3, 0, 2, 0, 7, 0, 7 },
				{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
				{ 7, 0, 7, 0, 7, 0, 7, 0, 7, 0, 7, 0, 7, 0, 7 },
				{ 0, 0, 7, 0, 7, 0, 7, 0, 7, 0, 7, 0, 7, 0, 0 } };

		int x, y;
		for (int i = 0; i < 90; i++) {
			x = randomX();
			y = randomY();
			while (isHardware(x, y)
					|| (x < 3 && y < 3 || x > 11 && y > 9 || isBox(x, y))) {
				x = randomX();
				y = randomY();
			}
			if (randomBool())
				map[y][x] += BOX[0];
			else
				map[y][x] += BOX[1];

		}
	}

}
